Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoints Method (Int32, StringList, PointList, ViewBase)
 Requests N picks of points from the user.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void PickPoints(
	int numberOfPicks,
	StringList prompts,
	out PointList pickedPoints,
	out ViewBase pickedView
)
Public Sub PickPoints (
	numberOfPicks As Integer,
	prompts As StringList,
	<OutAttribute> ByRef pickedPoints As PointList,
	<OutAttribute> ByRef pickedView As ViewBase
)
Parameters
numberOfPicks
Type: System.Int32
The number of requested picks.
prompts
Type: Tekla.Structures.Drawing.StringList
The prompts shown in the status bar before the picks. See the class remarks for more information about prompts.
pickedPoints
Type: Tekla.Structures.Drawing.PointList
The picked points in the view coordinates.
pickedView
Type: Tekla.Structures.Drawing.ViewBase
The view in which the pick occurred.
Exceptions
Exception | Condition
InvalidPluginPickerInputException |  Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
PickerInterruptedException |  Thrown when the user interrupts the picker before anything has been picked.
See Also
Reference
Picker Class
PickPoints Overload
Tekla.Structures.Drawing.UI Namespace